Extensions/нп_ДатыЗапретаИзменения/configurator/InformationRegisters/нп_СостояниеОткрытыхПериодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>нп_СостояниеОткрытыхПериодов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:DefinedType.АдресатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделДатыЗапрета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДатыЗапрета</Name>
					<Type>
						<v8:Type>cfg:Characteristic.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>ЗаявкаНаОткрытиеПериода</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.нп_ЗаявкаНаОткрытиеПериода</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапретаДоОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаписьБылаУстановленаАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/нп_ДатыЗапретаИзменения/configurator/InformationRegisters/нп_НастройкиАвтоматическойУстановкиДатЗапрета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>нп_НастройкиАвтоматическойУстановкиДатЗапрета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:DefinedType.АдресатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделДатыЗапрета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДатыЗапрета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
						<v8:Type>cfg:CatalogRef.СценарииТоварногоПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>ЧислоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Включено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/нп_ДатыЗапретаИзменения/configurator/Enums/нп_СпособыУказанияОткрытияПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>нп_СпособыУказанияОткрытияПериода</Name>
			<Comment>Как в типовой форме дат запрета: по разделам или по разделам и объектам</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоРазделам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРазделамИОбъектам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/нп_ДатыЗапретаИзменения/configurator/Documents/нп_ЗаявкаНаОткрытиеПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>нп_ЗаявкаНаОткрытиеПериода</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделДатыЗапрета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОткрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУказания</Name>
					<Comment>Как в типовой форме дат запрета</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.нп_СпособыУказанияОткрытияПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектДатыЗапрета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
								<v8:Type>cfg:CatalogRef.СценарииТоварногоПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделДатыЗапрета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/нп_ДатыЗапретаИзменения/configurator/CommonModules/нп_ДатыЗапретаИзменения/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Регламентное задание нп_СдвигДатЗапретаИзменения.
// Сначала возвращает истёкшие открытые периоды, затем актуализирует автоматические
// записи типового регистра по включённым настройкам. Ручные записи не изменяет.
//
Процедура СдвигДатЗапретаИзменения() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Ошибки = Новый Массив;
	
	Попытка
		ВосстановитьИстекшиеОткрытыеПериоды(Ошибки);
	Исключение
		Ошибки.Добавить(КраткоеИПодробноеОписаниеОшибки(
			НСтр("ru = 'Восстановление истёкших открытых периодов'"),
			ИнформацияОбОшибке()));
	КонецПопытки;
	
	ПрименитьВключенныеНастройки(Ошибки);
	
	Если Ошибки.Количество() > 0 Тогда
		ОтправитьУведомлениеОбОшибках(Ошибки);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик смены состояния согласования в ДО 3.
//
// Параметры:
//  ПредметСогласования - ЛюбаяСсылка
//  Состояние - ПеречислениеСсылка.СостоянияСогласованияВДокументообороте
//  ДатаУстановки - Дата
//
Процедура ОбработатьИзменениеСостоянияСогласования(ПредметСогласования, Состояние, ДатаУстановки) Экспорт
	
	Если ТипЗнч(ПредметСогласования) <> Тип("ДокументСсылка.нп_ЗаявкаНаОткрытиеПериода") Тогда
		Возврат;
	КонецЕсли;
	
	Если Состояние <> Перечисления.СостоянияСогласованияВДокументообороте.Согласован Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ОткрытьПериодПоЗаявке(ПредметСогласования, ДатаУстановки);
	Исключение
		ЗаписатьВЖурнал(
			УровеньЖурналаРегистрации.Ошибка,
			СтрШаблон(НСтр("ru = 'Не удалось открыть период по заявке %1'"), ПредметСогласования),
			ПредметСогласования,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

// Записывает отсечку по согласованной заявке и строки регистра состояния.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.нп_ЗаявкаНаОткрытиеПериода
//  ДатаСогласования - Дата
//
Процедура ОткрытьПериодПоЗаявке(ДокументСсылка, ДатаСогласования) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка,
		"ПериодС, СрокДействия, РазделДатыЗапрета, Пользователь");
	
	Если Не ЗначениеЗаполнено(Реквизиты.Пользователь) Тогда
		ВызватьИсключение НСтр("ru = 'Пользователь (или группа пользователей) обязателен. Заявка открывает период только для указанного адресата, не «для всех».'");
	КонецЕсли;
	
	Комбинации = РазвернутыеКомбинацииЗаявки(ДокументСсылка);
	Если Комбинации.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'В заявке нет комбинаций для открытия периода.'");
	КонецЕсли;
	
	ДатаСогласованияДень = НачалоДня(ДатаСогласования);
	Если Не ЗначениеЗаполнено(ДатаСогласованияДень) Тогда
		ДатаСогласованияДень = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	
	ДатаОкончания = ДатаСогласованияДень + (Реквизиты.СрокДействия - 1) * 86400;
	Отсечка = НачалоДня(Реквизиты.ПериодС) - 86400;
	Адресат = КаноническийПользователь(Реквизиты.Пользователь);
	
	ПроверкаБылаОтключена = НачатьЗаписьТиповогоРегистра();
	Попытка
		Для Каждого Комбинация Из Комбинации Цикл
			ПрименитьОткрытиеПоКомбинации(Комбинация, Адресат, Отсечка, ДатаОкончания, ДокументСсылка);
		КонецЦикла;
		ДатыЗапретаИзмененияСлужебный.ОбновитьВерсиюДатЗапретаИзменения();
	Исключение
		ЗакончитьЗаписьТиповогоРегистра(ПроверкаБылаОтключена);
		ВызватьИсключение;
	КонецПопытки;
	
	ЗакончитьЗаписьТиповогоРегистра(ПроверкаБылаОтключена);
	
	ЗаписатьВЖурнал(
		УровеньЖурналаРегистрации.Информация,
		СтрШаблон(
			НСтр("ru = 'Открыт период по заявке %1: отсечка %2, окончание %3'"),
			ДокументСсылка,
			Формат(Отсечка, "ДЛФ=D"),
			Формат(ДатаОкончания, "ДЛФ=D")),
		ДокументСсылка);
	
КонецПроцедуры

// Немедленный возврат границы по заявке (команда «Закрыть период досрочно»).
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.нп_ЗаявкаНаОткрытиеПериода
//
Процедура ЗакрытьПериодДосрочно(ДокументСсылка) Экспорт
	
	Если Не ЭтоПолноправныйПользовательСеанса() Тогда
		ВызватьИсключение НСтр("ru = 'Досрочное закрытие периода доступно только полноправному пользователю.'");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Состояние.ОбъектДатыЗапрета КАК ОбъектДатыЗапрета,
		|	Состояние.Пользователь КАК Пользователь,
		|	Состояние.РазделДатыЗапрета КАК РазделДатыЗапрета,
		|	Состояние.ДатаЗапретаДоОткрытия КАК ДатаЗапретаДоОткрытия,
		|	Состояние.ЗаписьБылаУстановленаАвтоматически КАК ЗаписьБылаУстановленаАвтоматически
		|ИЗ
		|	РегистрСведений.нп_СостояниеОткрытыхПериодов КАК Состояние
		|ГДЕ
		|	Состояние.ЗаявкаНаОткрытиеПериода = &Заявка");
	Запрос.УстановитьПараметр("Заявка", ДокументСсылка);
	ТаблицаСостояний = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаСостояний.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Нет действующего открытого периода по этой заявке (возможно, период уже закрыт или заявкой-основанием является другая заявка).'");
	КонецЕсли;
	
	ПроверкаБылаОтключена = НачатьЗаписьТиповогоРегистра();
	Попытка
		Для Каждого СтрокаСостояния Из ТаблицаСостояний Цикл
			ВосстановитьТиповуюЗапись(
				СтрокаСостояния.РазделДатыЗапрета,
				СтрокаСостояния.ОбъектДатыЗапрета,
				СтрокаСостояния.Пользователь,
				СтрокаСостояния.ДатаЗапретаДоОткрытия,
				СтрокаСостояния.ЗаписьБылаУстановленаАвтоматически);
			УдалитьСостояние(
				СтрокаСостояния.РазделДатыЗапрета,
				СтрокаСостояния.ОбъектДатыЗапрета,
				СтрокаСостояния.Пользователь);
		КонецЦикла;
		ДатыЗапретаИзмененияСлужебный.ОбновитьВерсиюДатЗапретаИзменения();
	Исключение
		ЗакончитьЗаписьТиповогоРегистра(ПроверкаБылаОтключена);
		ВызватьИсключение;
	КонецПопытки;
	ЗакончитьЗаписьТиповогоРегистра(ПроверкаБылаОтключена);
	
	ЗаписатьВЖурнал(
		УровеньЖурналаРегистрации.Информация,
		СтрШаблон(НСтр("ru = 'Период по заявке %1 закрыт досрочно'"), ДокументСсылка),
		ДокументСсылка);
	
КонецПроцедуры

// Абсолютная дата запрета: текущий день минус N календарных дней, включая текущий.
//
// Параметры:
//  ЧислоДней - Число
//  ДатаРасчета - Дата
//
// Возвращаемое значение:
//  Дата
//
Функция ДатаЗапретаПоЧислуДней(ЧислоДней, ДатаРасчета) Экспорт
	
	Возврат НачалоДня(ДатаРасчета) - ЧислоДней * 86400;
	
КонецФункции

// Возвращает Истина, если заявка согласована в ДО 3.
//
Функция ДокументСогласован(ДокументСсылка) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Состояние = СостояниеСогласованияДО(ДокументСсылка);
	Возврат Состояние.Состояние = Перечисления.СостоянияСогласованияВДокументообороте.Согласован;
	
КонецФункции

// Возвращает Истина, если по заявке есть строки регистра состояния.
//
Функция ЕстьДействующееСостояниеПоЗаявке(ДокументСсылка) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЕстьЗапись
		|ИЗ
		|	РегистрСведений.нп_СостояниеОткрытыхПериодов КАК Состояние
		|ГДЕ
		|	Состояние.ЗаявкаНаОткрытиеПериода = &Заявка");
	Запрос.УстановитьПараметр("Заявка", ДокументСсылка);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Текст постоянного пояснения на форме заявки.
//
Функция ТекстПоясненияЗаявки() Экспорт
	
	Возврат НСтр("ru = 'Согласованная заявка разрешает менять документы с даты «Открыть период с» и более поздние. Срок — столько дней, сколько указано. Когда срок закончится, запрет вернётся сам.'");
	
КонецФункции

// Состояние согласования объекта в ДО по типовым регистрам (без веб-вызова).
//
Функция СостояниеСогласованияДО(СсылкаНаОбъект) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьСвязьСДО", Ложь);
	Результат.Вставить("Состояние", Неопределено);
	Результат.Вставить("Представление", НСтр("ru = 'Нет связи с Документооборотом'"));
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОбъектыИнтегрированныеС1СДокументооборотом.ИдентификаторОбъектаДО КАК ИдентификаторОбъектаДО,
		|	СостоянияСогласованияВДокументообороте.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.ОбъектыИнтегрированныеС1СДокументооборотом КАК ОбъектыИнтегрированныеС1СДокументооборотом
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСогласованияВДокументообороте КАК СостоянияСогласованияВДокументообороте
		|		ПО ОбъектыИнтегрированныеС1СДокументооборотом.ИдентификаторОбъектаДО = СостоянияСогласованияВДокументообороте.ИдентификаторОбъектаДО
		|ГДЕ
		|	ОбъектыИнтегрированныеС1СДокументооборотом.Объект = &СсылкаНаОбъект");
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.ЕстьСвязьСДО = Истина;
	Результат.Состояние = Выборка.Состояние;
	
	Если Не ЗначениеЗаполнено(Выборка.Состояние) Тогда
		Результат.Представление = НСтр("ru = 'Связан с ДО, состояние не задано'");
	Иначе
		Результат.Представление = Строка(Выборка.Состояние);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет запись регистра настроек: несовместимые типы объекта и раздела.
// Пустые объект и раздел одновременно допустимы: общая дата адресата в типовом РС.
//
Процедура ПроверитьЗаписьНастройки(ОбъектДатыЗапрета, РазделДатыЗапрета) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектДатыЗапрета) И Не ЗначениеЗаполнено(РазделДатыЗапрета) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектДатыЗапрета) И ЗначениеЗаполнено(РазделДатыЗапрета) Тогда
		ИменаРазделов = ИменаРазделовДляТипаОбъекта(ТипЗнч(ОбъектДатыЗапрета));
		ИмяРаздела = ИмяРазделаПоСсылке(РазделДатыЗапрета);
		Если ИменаРазделов.Найти(ИмяРаздела) = Неопределено Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Раздел «%1» недопустим для типа объекта «%2».'"),
				Строка(РазделДатыЗапрета),
				Строка(ТипЗнч(ОбъектДатыЗапрета)));
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОбъектДатыЗапрета) И ЗначениеЗаполнено(РазделДатыЗапрета) Тогда
		Если Не ЗначениеЗаполнено(ИмяРазделаПоСсылке(РазделДатыЗапрета)) Тогда
			ВызватьИсключение НСтр("ru = 'Указанный раздел не входит в закрытый перечень доработки.'");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Проверяет реквизиты заявки перед записью.
// Пользователь обязателен. Пустые объект и раздел одновременно допустимы: общая дата адресата.
//
Процедура ПроверитьЗаявкуПередЗаписью(ДокументОбъект) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.Пользователь) Тогда
		ВызватьИсключение НСтр("ru = 'Пользователь (или группа пользователей) обязателен. Заявка открывает период только для указанного адресата, не «для всех».'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.ПериодС) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнен реквизит «Открыть период с».'");
	КонецЕсли;
	
	Если ДокументОбъект.СрокДействия < 1 Тогда
		ВызватьИсключение НСтр("ru = 'Срок действия должен быть не меньше 1 дня.'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.ПричинаОткрытия) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнена причина открытия периода.'");
	КонецЕсли;
	
	ЕстьЗаполненнаяСтрока = Ложь;
	УказаниеПоРазделам = УказаниеЗаявкиПоРазделам(ДокументОбъект);
	
	Для Каждого СтрокаОбъекта Из ДокументОбъект.Объекты Цикл
		РазделСтроки = РазделСтрокиЗаявки(СтрокаОбъекта, ДокументОбъект.РазделДатыЗапрета);
		Если УказаниеПоРазделам Тогда
			Если Не ЗначениеЗаполнено(РазделСтроки) Тогда
				Продолжить;
			КонецЕсли;
			ЕстьЗаполненнаяСтрока = Истина;
			ПроверитьЗаписьНастройки(Неопределено, РазделСтроки);
		Иначе
			Если Не ЗначениеЗаполнено(СтрокаОбъекта.ОбъектДатыЗапрета) И Не ЗначениеЗаполнено(РазделСтроки) Тогда
				Продолжить;
			КонецЕсли;
			ЕстьЗаполненнаяСтрока = Истина;
			ПроверитьЗаписьНастройки(СтрокаОбъекта.ОбъектДатыЗапрета, РазделСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьЗаполненнаяСтрока Тогда
		ПроверитьЗаписьНастройки(Неопределено, ДокументОбъект.РазделДатыЗапрета);
	КонецЕсли;
	
КонецПроцедуры

// Истина, если текущий пользователь полноправный.
//
Функция ЭтоПолноправныйПользовательСеанса() Экспорт
	
	Возврат Пользователи.ЭтоПолноправныйПользователь();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВосстановитьИстекшиеОткрытыеПериоды(Ошибки)
	
	ДатаСеанса = НачалоДня(ТекущаяДатаСеанса());
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Состояние.ОбъектДатыЗапрета КАК ОбъектДатыЗапрета,
		|	Состояние.Пользователь КАК Пользователь,
		|	Состояние.РазделДатыЗапрета КАК РазделДатыЗапрета,
		|	Состояние.ДатаЗапретаДоОткрытия КАК ДатаЗапретаДоОткрытия,
		|	Состояние.ЗаписьБылаУстановленаАвтоматически КАК ЗаписьБылаУстановленаАвтоматически,
		|	Состояние.ЗаявкаНаОткрытиеПериода КАК ЗаявкаНаОткрытиеПериода,
		|	Состояние.ДатаОкончанияДействия КАК ДатаОкончанияДействия
		|ИЗ
		|	РегистрСведений.нп_СостояниеОткрытыхПериодов КАК Состояние
		|ГДЕ
		|	Состояние.ДатаОкончанияДействия < &ДатаСеанса");
	Запрос.УстановитьПараметр("ДатаСеанса", ДатаСеанса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПроверкаБылаОтключена = НачатьЗаписьТиповогоРегистра();
	Попытка
		Пока Выборка.Следующий() Цикл
			Попытка
				ВосстановитьТиповуюЗапись(
					Выборка.РазделДатыЗапрета,
					Выборка.ОбъектДатыЗапрета,
					Выборка.Пользователь,
					Выборка.ДатаЗапретаДоОткрытия,
					Выборка.ЗаписьБылаУстановленаАвтоматически);
				УдалитьСостояние(
					Выборка.РазделДатыЗапрета,
					Выборка.ОбъектДатыЗапрета,
					Выборка.Пользователь);
				ЗаписатьВЖурнал(
					УровеньЖурналаРегистрации.Информация,
					СтрШаблон(
						НСтр("ru = 'Возвращена граница: раздел %1, объект %2, пользователь %3, заявка %4'"),
						Выборка.РазделДатыЗапрета,
						Выборка.ОбъектДатыЗапрета,
						Выборка.Пользователь,
						Выборка.ЗаявкаНаОткрытиеПериода),
					Выборка.ЗаявкаНаОткрытиеПериода);
			Исключение
				Ошибки.Добавить(КраткоеИПодробноеОписаниеОшибки(
					СтрШаблон(
						НСтр("ru = 'Возврат границы: объект %1, раздел %2, пользователь %3'"),
						Выборка.ОбъектДатыЗапрета,
						Выборка.РазделДатыЗапрета,
						Выборка.Пользователь),
					ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЦикла;
		ДатыЗапретаИзмененияСлужебный.ОбновитьВерсиюДатЗапретаИзменения();
	Исключение
		ЗакончитьЗаписьТиповогоРегистра(ПроверкаБылаОтключена);
		ВызватьИсключение;
	КонецПопытки;
	ЗакончитьЗаписьТиповогоРегистра(ПроверкаБылаОтключена);
	
КонецПроцедуры

Процедура ПрименитьВключенныеНастройки(Ошибки)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Настройки.ОбъектДатыЗапрета КАК ОбъектДатыЗапрета,
		|	Настройки.Пользователь КАК Пользователь,
		|	Настройки.РазделДатыЗапрета КАК РазделДатыЗапрета,
		|	Настройки.ЧислоДней КАК ЧислоДней
		|ИЗ
		|	РегистрСведений.нп_НастройкиАвтоматическойУстановкиДатЗапрета КАК Настройки
		|ГДЕ
		|	Настройки.Включено");
	
	Выборка = Запрос.Выполнить().Выбрать();
	ДатаСеанса = ТекущаяДатаСеанса();
	АктуальныеКлючи = Новый Соответствие;
	ОшибокНастроек = 0;
	
	ПроверкаБылаОтключена = НачатьЗаписьТиповогоРегистра();
	Попытка
		Пока Выборка.Следующий() Цикл
			Попытка
				ПрименитьОднуНастройку(Выборка, ДатаСеанса, АктуальныеКлючи);
			Исключение
				ОшибокНастроек = ОшибокНастроек + 1;
				Ошибки.Добавить(КраткоеИПодробноеОписаниеОшибки(
					СтрШаблон(
						НСтр("ru = 'Настройка: объект %1, раздел %2, пользователь %3, N=%4'"),
						Выборка.ОбъектДатыЗапрета,
						Выборка.РазделДатыЗапрета,
						Выборка.Пользователь,
						Выборка.ЧислоДней),
					ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЦикла;
		ДополнитьОбщиеДатыДетальнымАдресатам(АктуальныеКлючи);
		Если ОшибокНастроек = 0 Тогда
			УдалитьУстаревшиеАвтозаписи(АктуальныеКлючи);
		КонецЕсли;
		ДатыЗапретаИзмененияСлужебный.ОбновитьВерсиюДатЗапретаИзменения();
	Исключение
		ЗакончитьЗаписьТиповогоРегистра(ПроверкаБылаОтключена);
		ВызватьИсключение;
	КонецПопытки;
	ЗакончитьЗаписьТиповогоРегистра(ПроверкаБылаОтключена);
	
КонецПроцедуры

Процедура ПрименитьОднуНастройку(Настройка, ДатаСеанса, АктуальныеКлючи)
	
	Комбинации = РазвернутыеКомбинацииНастройки(
		Настройка.ОбъектДатыЗапрета,
		Настройка.РазделДатыЗапрета);
	Адресат = КаноническийПользователь(Настройка.Пользователь);
	ДатаЗапрета = ДатаЗапретаПоЧислуДней(Настройка.ЧислоДней, ДатаСеанса);
	Комментарий = КомментарийАвтозаписи(Адресат, Настройка.ЧислоДней);
	
	Для Каждого Комбинация Из Комбинации Цикл
		АктуальныеКлючи.Вставить(КлючТиповойЗаписи(Комбинация.Раздел, Комбинация.Объект, Адресат), Истина);
		Если ЕстьДействующееСостояниеКомбинации(Комбинация.Раздел, Комбинация.Объект, Адресат) Тогда
			Продолжить;
		КонецЕсли;
		ТекущаяТиповая = ПрочитатьТиповуюЗапись(Комбинация.Раздел, Комбинация.Объект, Адресат);
		Если ТекущаяТиповая.ЕстьЗапись И ЭтоРучнаяТиповаяЗапись(ТекущаяТиповая.Комментарий) Тогда
			Продолжить;
		КонецЕсли;
		ЗаписатьТиповуюДатуЗапрета(Комбинация.Раздел, Комбинация.Объект, Адресат, ДатаЗапрета, Комментарий);
	КонецЦикла;
	
КонецПроцедуры

// БСП выбирает адресата целиком: личная запись по одному объекту отключает
// набор «для всех» / группы. Чтобы остальные разделы не остались без запрета,
// детальному адресату без своей общей даты копируется общая дата родителя.
//
Процедура ДополнитьОбщиеДатыДетальнымАдресатам(АктуальныеКлючи)
	
	ПустойРаздел = ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПустаяСсылка();
	
	Записи = ВсеЗаписиТиповогоРегистра();
	ОбщиеДаты = ОбщиеАвтодатыПоАдресатам(Записи);
	ДетальныеАдресаты = АдресатыСДетальнымиЗаписями(Записи);
	
	Для Каждого Адресат Из АдресатыГрупп(ДетальныеАдресаты) Цикл
		Если АктуальныеКлючи.Получить(КлючТиповойЗаписи(ПустойРаздел, ПустойРаздел, Адресат)) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Родитель = ОбщиеДаты.Получить(Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей);
		Если Родитель = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Комментарий = МаксимальныйАвтоКомментарийАдресата(Записи, Адресат);
		Если ЗаписатьНаследуемуюОбщуюДату(Адресат, ПустойРаздел, Родитель.ДатаЗапрета, Комментарий, АктуальныеКлючи) Тогда
			ОбщиеДаты.Вставить(Адресат, Новый Структура("ДатаЗапрета, Комментарий", Родитель.ДатаЗапрета, Комментарий));
		КонецЕсли;
	КонецЦикла;
	
	ОбщиеДатыГруппПользователей = ОбщиеДатыВыигрывающихГрупп(ОбщиеДаты);
	
	Для Каждого Адресат Из АдресатыПользователей(ДетальныеАдресаты) Цикл
		Если АктуальныеКлючи.Получить(КлючТиповойЗаписи(ПустойРаздел, ПустойРаздел, Адресат)) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Родитель = ОбщиеДатыГруппПользователей.Получить(Адресат);
		Если Родитель = Неопределено Тогда
			Родитель = ОбщиеДаты.Получить(Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей);
		КонецЕсли;
		Если Родитель = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаписатьНаследуемуюОбщуюДату(
			Адресат,
			ПустойРаздел,
			Родитель.ДатаЗапрета,
			ПрефиксАвтоКомментария(),
			АктуальныеКлючи);
	КонецЦикла;
	
КонецПроцедуры

Функция ВсеЗаписиТиповогоРегистра()
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Даты.Пользователь КАК Пользователь,
		|	Даты.Раздел КАК Раздел,
		|	Даты.Объект КАК Объект,
		|	Даты.ДатаЗапрета КАК ДатаЗапрета,
		|	Даты.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.ДатыЗапретаИзменения КАК Даты");
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ОбщиеАвтодатыПоАдресатам(Записи)
	
	Результат = Новый Соответствие;
	Для Каждого СтрокаЗаписи Из Записи Цикл
		Если ЗначениеЗаполнено(СтрокаЗаписи.Раздел) Или ЗначениеЗаполнено(СтрокаЗаписи.Объект) Тогда
			Продолжить;
		КонецЕсли;
		Если Не ЭтоАвтоматическаяТиповаяЗапись(СтрокаЗаписи.Комментарий) Тогда
			Продолжить;
		КонецЕсли;
		Результат.Вставить(
			СтрокаЗаписи.Пользователь,
			Новый Структура("ДатаЗапрета, Комментарий", СтрокаЗаписи.ДатаЗапрета, СтрокаЗаписи.Комментарий));
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Функция АдресатыСДетальнымиЗаписями(Записи)
	
	Результат = Новый Соответствие;
	Для Каждого СтрокаЗаписи Из Записи Цикл
		Если Не ЗначениеЗаполнено(СтрокаЗаписи.Раздел) И Не ЗначениеЗаполнено(СтрокаЗаписи.Объект) Тогда
			Продолжить;
		КонецЕсли;
		Результат.Вставить(СтрокаЗаписи.Пользователь, Истина);
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Функция АдресатыГрупп(ДетальныеАдресаты)
	
	Результат = Новый Массив;
	Для Каждого КлючИЗначение Из ДетальныеАдресаты Цикл
		Если ТипЗнч(КлючИЗначение.Ключ) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
			Результат.Добавить(КлючИЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Функция АдресатыПользователей(ДетальныеАдресаты)
	
	Результат = Новый Массив;
	Для Каждого КлючИЗначение Из ДетальныеАдресаты Цикл
		Если ТипЗнч(КлючИЗначение.Ключ) = Тип("СправочникСсылка.Пользователи") Тогда
			Результат.Добавить(КлючИЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Функция МаксимальныйАвтоКомментарийАдресата(Записи, Адресат)
	
	Комментарий = ПрефиксАвтоКомментария();
	Для Каждого СтрокаЗаписи Из Записи Цикл
		Если СтрокаЗаписи.Пользователь <> Адресат Тогда
			Продолжить;
		КонецЕсли;
		Если Не ЭтоАвтоматическаяТиповаяЗапись(СтрокаЗаписи.Комментарий) Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаЗаписи.Комментарий > Комментарий Тогда
			Комментарий = СтрокаЗаписи.Комментарий;
		КонецЕсли;
	КонецЦикла;
	Возврат Комментарий;
	
КонецФункции

Функция ОбщиеДатыВыигрывающихГрупп(ОбщиеДаты)
	
	Результат = Новый Соответствие;
	ВыбраннаяГруппа = Новый Соответствие;
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Состав.Пользователь КАК Пользователь,
		|	Состав.ГруппаПользователей КАК ГруппаПользователей,
		|	Даты.Комментарий КАК Комментарий,
		|	ЕСТЬNULL(Состав.ГруппаПользователей.Наименование, """") КАК НаименованиеГруппы
		|ИЗ
		|	РегистрСведений.СоставыГруппПользователей КАК Состав
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДатыЗапретаИзменения КАК Даты
		|		ПО Состав.ГруппаПользователей = Даты.Пользователь
		|ГДЕ
		|	Состав.ГруппаПользователей <> Состав.Пользователь
		|
		|УПОРЯДОЧИТЬ ПО
		|	Пользователь,
		|	Комментарий УБЫВ,
		|	НаименованиеГруппы УБЫВ");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ВыбраннаяГруппа.Получить(Выборка.Пользователь) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ВыбраннаяГруппа.Вставить(Выборка.Пользователь, Выборка.ГруппаПользователей);
		Родитель = ОбщиеДаты.Получить(Выборка.ГруппаПользователей);
		Если Родитель <> Неопределено Тогда
			Результат.Вставить(Выборка.Пользователь, Родитель);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Функция ЗаписатьНаследуемуюОбщуюДату(Адресат, ПустойРаздел, ДатаЗапрета, Комментарий, АктуальныеКлючи)
	
	Если ЕстьДействующееСостояниеКомбинации(ПустойРаздел, ПустойРаздел, Адресат) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекущаяТиповая = ПрочитатьТиповуюЗапись(ПустойРаздел, ПустойРаздел, Адресат);
	Если ТекущаяТиповая.ЕстьЗапись И ЭтоРучнаяТиповаяЗапись(ТекущаяТиповая.Комментарий) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ТекущаяТиповая.ЕстьЗапись И ЭтоКомментарийОткрытия(ТекущаяТиповая.Комментарий) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗаписатьТиповуюДатуЗапрета(ПустойРаздел, ПустойРаздел, Адресат, ДатаЗапрета, Комментарий);
	АктуальныеКлючи.Вставить(КлючТиповойЗаписи(ПустойРаздел, ПустойРаздел, Адресат), Истина);
	Возврат Истина;
	
КонецФункции

Процедура ПрименитьОткрытиеПоКомбинации(Комбинация, Адресат, Отсечка, ДатаОкончания, ДокументСсылка)
	
	ТекущееСостояние = ПрочитатьСостояние(Комбинация.Раздел, Комбинация.Объект, Адресат);
	ТекущаяТиповая = ПрочитатьТиповуюЗапись(Комбинация.Раздел, Комбинация.Объект, Адресат);
	
	Если ТекущееСостояние = Неопределено Тогда
		ДатаДоОткрытия = ТекущаяТиповая.ДатаЗапрета;
		БылаАвто = ЭтоАвтоматическаяТиповаяЗапись(ТекущаяТиповая.Комментарий);
		ЗаписатьТиповуюДатуЗапрета(
			Комбинация.Раздел,
			Комбинация.Объект,
			Адресат,
			Отсечка,
			КомментарийОткрытия(ДокументСсылка));
		ЗаписатьСостояние(
			Комбинация.Раздел,
			Комбинация.Объект,
			Адресат,
			ДокументСсылка,
			ДатаОкончания,
			ДатаДоОткрытия,
			БылаАвто);
		Возврат;
	КонецЕсли;
	
	НоваяОтсечка = Отсечка;
	Если ЗначениеЗаполнено(ТекущаяТиповая.ДатаЗапрета) Тогда
		НоваяОтсечка = Мин(ТекущаяТиповая.ДатаЗапрета, Отсечка);
	КонецЕсли;
	НовоеОкончание = Макс(ТекущееСостояние.ДатаОкончанияДействия, ДатаОкончания);
	
	ЗаписатьТиповуюДатуЗапрета(
		Комбинация.Раздел,
		Комбинация.Объект,
		Адресат,
		НоваяОтсечка,
		КомментарийОткрытия(ТекущееСостояние.ЗаявкаНаОткрытиеПериода));
	
	ЗаписатьСостояние(
		Комбинация.Раздел,
		Комбинация.Объект,
		Адресат,
		ТекущееСостояние.ЗаявкаНаОткрытиеПериода,
		НовоеОкончание,
		ТекущееСостояние.ДатаЗапретаДоОткрытия,
		ТекущееСостояние.ЗаписьБылаУстановленаАвтоматически);
	
	ЗаписатьВЖурнал(
		УровеньЖурналаРегистрации.Информация,
		СтрШаблон(
			НСтр("ru = 'Пересечение заявок: основание %1, новая %2, отсечка %3, окончание %4'"),
			ТекущееСостояние.ЗаявкаНаОткрытиеПериода,
			ДокументСсылка,
			Формат(НоваяОтсечка, "ДЛФ=D"),
			Формат(НовоеОкончание, "ДЛФ=D")),
		ДокументСсылка);
	
КонецПроцедуры

Функция РазвернутыеКомбинацииНастройки(ОбъектДатыЗапрета, РазделДатыЗапрета)
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(ОбъектДатыЗапрета) И ЗначениеЗаполнено(РазделДатыЗапрета) Тогда
		ДобавитьКомбинацию(Результат, РазделДатыЗапрета, ОбъектДатыЗапрета);
		Возврат Результат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОбъектДатыЗапрета) И ЗначениеЗаполнено(РазделДатыЗапрета) Тогда
		ДобавитьКомбинацию(Результат, РазделДатыЗапрета, РазделДатыЗапрета);
		Возврат Результат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектДатыЗапрета) И Не ЗначениеЗаполнено(РазделДатыЗапрета) Тогда
		Для Каждого ИмяРаздела Из ИменаРазделовДляТипаОбъекта(ТипЗнч(ОбъектДатыЗапрета)) Цикл
			СсылкаРаздела = СсылкаРазделаПоИмени(ИмяРаздела);
			Если ЗначениеЗаполнено(СсылкаРаздела) Тогда
				ДобавитьКомбинацию(Результат, СсылкаРаздела, ОбъектДатыЗапрета);
			КонецЕсли;
		КонецЦикла;
		Если Результат.Количество() = 0 Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Не найдены разделы закрытого перечня для типа объекта «%1».'"),
				Строка(ТипЗнч(ОбъектДатыЗапрета)));
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;
	
	ПустойРаздел = ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПустаяСсылка();
	ДобавитьКомбинацию(Результат, ПустойРаздел, ПустойРаздел);
	Возврат Результат;
	
КонецФункции

Функция РазделСтрокиЗаявки(СтрокаОбъекта, РазделШапки)
	
	Если ЗначениеЗаполнено(СтрокаОбъекта.РазделДатыЗапрета) Тогда
		Возврат СтрокаОбъекта.РазделДатыЗапрета;
	КонецЕсли;
	
	Возврат РазделШапки;
	
КонецФункции

Функция УказаниеЗаявкиПоРазделам(ДокументОбъект)
	
	Если ДокументОбъект.СпособУказания = Перечисления.нп_СпособыУказанияОткрытияПериода.ПоРазделам Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ДокументОбъект.СпособУказания = Перечисления.нп_СпособыУказанияОткрытияПериода.ПоРазделамИОбъектам Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаОбъекта Из ДокументОбъект.Объекты Цикл
		Если ЗначениеЗаполнено(СтрокаОбъекта.ОбъектДатыЗапрета) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция УказаниеСсылкиПоРазделам(СпособУказания, ОбъектыЗаявки)
	
	Если СпособУказания = Перечисления.нп_СпособыУказанияОткрытияПериода.ПоРазделам Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если СпособУказания = Перечисления.нп_СпособыУказанияОткрытияПериода.ПоРазделамИОбъектам Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаОбъекта Из ОбъектыЗаявки Цикл
		Если ЗначениеЗаполнено(СтрокаОбъекта.ОбъектДатыЗапрета) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция РазвернутыеКомбинацииЗаявки(ДокументСсылка)
	
	Результат = Новый Массив;
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "РазделДатыЗапрета, СпособУказания");
	РазделШапки = Реквизиты.РазделДатыЗапрета;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Объекты.ОбъектДатыЗапрета КАК ОбъектДатыЗапрета,
		|	Объекты.РазделДатыЗапрета КАК РазделДатыЗапрета
		|ИЗ
		|	Документ.нп_ЗаявкаНаОткрытиеПериода.Объекты КАК Объекты
		|ГДЕ
		|	Объекты.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	ОбъектыЗаявки = Запрос.Выполнить().Выгрузить();
	
	УказаниеПоРазделам = УказаниеСсылкиПоРазделам(Реквизиты.СпособУказания, ОбъектыЗаявки);
	
	Для Каждого СтрокаОбъекта Из ОбъектыЗаявки Цикл
		РазделСтроки = РазделСтрокиЗаявки(СтрокаОбъекта, РазделШапки);
		Если УказаниеПоРазделам Тогда
			Если Не ЗначениеЗаполнено(РазделСтроки) Тогда
				Продолжить;
			КонецЕсли;
			КомбинацииСтроки = РазвернутыеКомбинацииНастройки(Неопределено, РазделСтроки);
		Иначе
			Если Не ЗначениеЗаполнено(СтрокаОбъекта.ОбъектДатыЗапрета) И Не ЗначениеЗаполнено(РазделСтроки) Тогда
				Продолжить;
			КонецЕсли;
			КомбинацииСтроки = РазвернутыеКомбинацииНастройки(СтрокаОбъекта.ОбъектДатыЗапрета, РазделСтроки);
		КонецЕсли;
		Для Каждого Комбинация Из КомбинацииСтроки Цикл
			Результат.Добавить(Комбинация);
		КонецЦикла;
	КонецЦикла;
	
	Если Результат.Количество() = 0 Тогда
		Возврат РазвернутыеКомбинацииНастройки(Неопределено, РазделШапки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьКомбинацию(МассивКомбинаций, Раздел, Объект)
	
	Комбинация = Новый Структура("Раздел, Объект", Раздел, Объект);
	МассивКомбинаций.Добавить(Комбинация);
	
КонецПроцедуры

Функция КаноническийПользователь(ПользовательНастройки)
	
	Если Не ЗначениеЗаполнено(ПользовательНастройки) Тогда
		Возврат Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей;
	КонецЕсли;
	
	Если ТипЗнч(ПользовательНастройки) = Тип("ПеречислениеСсылка.ВидыНазначенияДатЗапрета") Тогда
		Возврат ПользовательНастройки;
	КонецЕсли;
	
	Возврат ПользовательНастройки;
	
КонецФункции

Функция КомментарийАвтозаписи(Адресат, ЧислоДней)
	
	Если ТипЗнч(Адресат) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
		Возврат ПрефиксАвтоКомментария() + "|" + Формат(ЧислоДней, "ЧЦ=5; ЧВН=; ЧГ=0");
	КонецЕсли;
	
	Возврат ПрефиксАвтоКомментария();
	
КонецФункции

Функция КомментарийОткрытия(ДокументСсылка)
	
	Возврат ПрефиксКомментарияОткрытия() + "|" + Строка(ДокументСсылка.УникальныйИдентификатор());
	
КонецФункции

Функция ПрефиксАвтоКомментария()
	
	Возврат "нп_авто";
	
КонецФункции

Функция ПрефиксКомментарияОткрытия()
	
	Возврат "нп_открытие";
	
КонецФункции

Функция ЭтоАвтоматическаяТиповаяЗапись(Комментарий)
	
	Возврат СтрНачинаетсяС(Строка(Комментарий), ПрефиксАвтоКомментария());
	
КонецФункции

Функция ЭтоКомментарийОткрытия(Комментарий)
	
	Возврат СтрНачинаетсяС(Строка(Комментарий), ПрефиксКомментарияОткрытия());
	
КонецФункции

Функция ЭтоРучнаяТиповаяЗапись(Комментарий)
	
	Возврат Не ЭтоАвтоматическаяТиповаяЗапись(Комментарий) И Не ЭтоКомментарийОткрытия(Комментарий);
	
КонецФункции

Функция КлючТиповойЗаписи(Раздел, Объект, Пользователь)
	
	Возврат XMLСтрока(Раздел) + Символы.ПС + XMLСтрока(Объект) + Символы.ПС + XMLСтрока(Пользователь);
	
КонецФункции

Процедура УдалитьУстаревшиеАвтозаписи(АктуальныеКлючи)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Даты.Раздел КАК Раздел,
		|	Даты.Объект КАК Объект,
		|	Даты.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.ДатыЗапретаИзменения КАК Даты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.нп_СостояниеОткрытыхПериодов КАК Состояние
		|		ПО Даты.Раздел = Состояние.РазделДатыЗапрета
		|			И Даты.Объект = Состояние.ОбъектДатыЗапрета
		|			И Даты.Пользователь = Состояние.Пользователь
		|ГДЕ
		|	Даты.Комментарий ПОДОБНО &ПрефиксАвто
		|	И Состояние.ЗаявкаНаОткрытиеПериода ЕСТЬ NULL");
	Запрос.УстановитьПараметр("ПрефиксАвто", ПрефиксАвтоКомментария() + "%");
	
	Удалено = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если АктуальныеКлючи.Получить(КлючТиповойЗаписи(Выборка.Раздел, Выборка.Объект, Выборка.Пользователь)) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		УдалитьТиповуюЗапись(Выборка.Раздел, Выборка.Объект, Выборка.Пользователь);
		Удалено = Удалено + 1;
	КонецЦикла;
	
	Если Удалено > 0 Тогда
		ЗаписатьВЖурнал(
			УровеньЖурналаРегистрации.Информация,
			СтрШаблон(НСтр("ru = 'Удалены устаревшие автоматические записи типового регистра: %1'"), Удалено));
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьТиповуюЗапись(Раздел, Объект, Пользователь)
	
	НаборЗаписей = РегистрыСведений.ДатыЗапретаИзменения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Раздел.Установить(Раздел);
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ИменаРазделовДляТипаОбъекта(ТипОбъекта)
	
	Если ТипОбъекта = Тип("СправочникСсылка.Организации") Тогда
		Имена = Новый Массив;
		Имена.Добавить("АвансовыеОтчеты");
		Имена.Добавить("БухгалтерскийУчет");
		Имена.Добавить("ВводОстатков");
		Имена.Добавить("ВнеоборотныеАктивы");
		Имена.Добавить("ВнутреннееТовародвижение");
		Имена.Добавить("Закупки");
		Имена.Добавить("МеждународныйУчет");
		Имена.Добавить("Продажи");
		Имена.Добавить("ПродажиМеждуОрганизациями");
		Имена.Добавить("Производство");
		Имена.Добавить("РегламентныеОперации");
		Имена.Добавить("РозничныеПродажи");
		Имена.Добавить("СверкиИКорректировкиЗадолженности");
		Имена.Добавить("ФинансовыйКонтур");
		Имена.Добавить("РетроБонусыКлиентов");
		Имена.Добавить("РетроБонусыПоставщиков");
		Имена.Добавить("УправлениеРемонтами");
		Имена.Добавить("УчетПоМСФО");
		Возврат Имена;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Кассы") Тогда
		Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Касса");
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Склады") Тогда
		Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("СкладскиеОперации");
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.БанковскиеСчетаОрганизаций") Тогда
		Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Банк");
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Сценарии") Тогда
		Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Бюджетирование");
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.СценарииТоварногоПланирования") Тогда
		Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Планирование");
	КонецЕсли;
	
	Возврат Новый Массив;
	
КонецФункции

Функция ИдентификаторРазделаПоИмени(ИмяРаздела)
	
	СоответствиеИдентификаторов = Новый Соответствие;
	СоответствиеИдентификаторов.Вставить("АвансовыеОтчеты", "199db5e2-c45a-4004-9e87-742579e7a749");
	СоответствиеИдентификаторов.Вставить("Банк", "0f558de9-37af-484b-8f46-1ba523cf01d2");
	СоответствиеИдентификаторов.Вставить("БухгалтерскийУчет", "2bdf6479-8eaf-4ec0-93a1-412e8659a178");
	СоответствиеИдентификаторов.Вставить("Бюджетирование", "10b010bf-ff02-407a-b71d-fa3d2c8186cc");
	СоответствиеИдентификаторов.Вставить("ВводОстатков", "c061d639-5929-11ea-87c6-1831bf523f36");
	СоответствиеИдентификаторов.Вставить("ВнеоборотныеАктивы", "1dc4b831-3ca1-11e7-9d6b-e0cb4ed5f5dc");
	СоответствиеИдентификаторов.Вставить("ВнутреннееТовародвижение", "a7c88ae7-129c-45c5-bdcd-df587700fa2d");
	СоответствиеИдентификаторов.Вставить("Закупки", "fc4596d4-f365-4986-b633-fe77017b938f");
	СоответствиеИдентификаторов.Вставить("Касса", "97e0cfbc-3a80-40d5-bbce-ce9c3e87e7d8");
	СоответствиеИдентификаторов.Вставить("МеждународныйУчет", "759a6987-ef82-442c-a4eb-2735afaa10d2");
	СоответствиеИдентификаторов.Вставить("Планирование", "0c370df6-fb93-499d-bec3-81c4b7dcfcf2");
	СоответствиеИдентификаторов.Вставить("Продажи", "f9d6852a-09c2-4505-901e-ac07fa0a73eb");
	СоответствиеИдентификаторов.Вставить("ПродажиМеждуОрганизациями", "c061d63b-5929-11ea-87c6-1831bf523f36");
	СоответствиеИдентификаторов.Вставить("Производство", "8795bd29-84ab-47b5-a59f-4fff6b242bab");
	СоответствиеИдентификаторов.Вставить("РегламентныеОперации", "49fca300-0137-4f5e-bc8d-af6cc30545a3");
	СоответствиеИдентификаторов.Вставить("РозничныеПродажи", "c061d646-5929-11ea-87c6-1831bf523f36");
	СоответствиеИдентификаторов.Вставить("СверкиИКорректировкиЗадолженности", "ece392ee-5209-4bfa-9f32-5b1244b1f74e");
	СоответствиеИдентификаторов.Вставить("СкладскиеОперации", "f37d661e-6540-4890-8642-f7481ff1ee7b");
	СоответствиеИдентификаторов.Вставить("ФинансовыйКонтур", "66a40e05-5ebd-11ea-87c6-1831bf523f36");
	СоответствиеИдентификаторов.Вставить("РетроБонусыКлиентов", "2974da80-1b5e-4d98-8a14-9cb26b560892");
	СоответствиеИдентификаторов.Вставить("РетроБонусыПоставщиков", "9a629851-6440-11ef-8435-005056be3dc8");
	СоответствиеИдентификаторов.Вставить("УправлениеРемонтами", "4fbd7445-50f5-4aa4-ac19-be884591f1b6");
	СоответствиеИдентификаторов.Вставить("УчетПоМСФО", "8a725811-e24d-4522-8995-070a4c2d0784");
	
	Возврат СоответствиеИдентификаторов.Получить(ИмяРаздела);
	
КонецФункции

Функция ИмяРазделаПоСсылке(СсылкаРаздела)
	
	Если Не ЗначениеЗаполнено(СсылкаРаздела) Тогда
		Возврат "";
	КонецЕсли;
	
	ИдентификаторСтрокой = НРег(Строка(СсылкаРаздела.УникальныйИдентификатор()));
	Для Каждого ИмяРаздела Из ВсеИменаРазделов() Цикл
		ИдентификаторРаздела = ИдентификаторРазделаПоИмени(ИмяРаздела);
		Если ИдентификаторРаздела <> Неопределено
			И НРег(ИдентификаторРаздела) = ИдентификаторСтрокой Тогда
			Возврат ИмяРаздела;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

Функция ВсеИменаРазделов()
	
	Имена = Новый Массив;
	Имена.Добавить("АвансовыеОтчеты");
	Имена.Добавить("Банк");
	Имена.Добавить("БухгалтерскийУчет");
	Имена.Добавить("Бюджетирование");
	Имена.Добавить("ВводОстатков");
	Имена.Добавить("ВнеоборотныеАктивы");
	Имена.Добавить("ВнутреннееТовародвижение");
	Имена.Добавить("Закупки");
	Имена.Добавить("Касса");
	Имена.Добавить("МеждународныйУчет");
	Имена.Добавить("Планирование");
	Имена.Добавить("Продажи");
	Имена.Добавить("ПродажиМеждуОрганизациями");
	Имена.Добавить("Производство");
	Имена.Добавить("РегламентныеОперации");
	Имена.Добавить("РозничныеПродажи");
	Имена.Добавить("СверкиИКорректировкиЗадолженности");
	Имена.Добавить("СкладскиеОперации");
	Имена.Добавить("ФинансовыйКонтур");
	Имена.Добавить("РетроБонусыКлиентов");
	Имена.Добавить("РетроБонусыПоставщиков");
	Имена.Добавить("УправлениеРемонтами");
	Имена.Добавить("УчетПоМСФО");
	Возврат Имена;
	
КонецФункции

Функция СсылкаРазделаПоИмени(ИмяРаздела)
	
	Идентификатор = ИдентификаторРазделаПоИмени(ИмяРаздела);
	Если Идентификатор = Неопределено Тогда
		Возврат ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПустаяСсылка();
	КонецЕсли;
	
	СсылкаРаздела = ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПолучитьСсылку(
		Новый УникальныйИдентификатор(Идентификатор));
	
	Если Не ОбщегоНазначения.СсылкаСуществует(СсылкаРаздела) Тогда
		Возврат ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПустаяСсылка();
	КонецЕсли;
	
	Возврат СсылкаРаздела;
	
КонецФункции

Процедура ЗаписатьТиповуюДатуЗапрета(Раздел, Объект, Пользователь, ДатаЗапрета, Комментарий)
	
	НаборЗаписей = РегистрыСведений.ДатыЗапретаИзменения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Раздел.Установить(Раздел);
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Раздел = Раздел;
		Запись.Объект = Объект;
		Запись.Пользователь = Пользователь;
	Иначе
		Запись = НаборЗаписей[0];
		Если Запись.ДатаЗапрета = ДатаЗапрета
			И Запись.ОписаниеДатыЗапрета = ""
			И Запись.Комментарий = Комментарий Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Запись.ДатаЗапрета = ДатаЗапрета;
	Запись.ОписаниеДатыЗапрета = "";
	Запись.Комментарий = Комментарий;
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ВосстановитьТиповуюЗапись(Раздел, Объект, Пользователь, ДатаЗапретаДоОткрытия, БылаАвто)
	
	НаборЗаписей = РегистрыСведений.ДатыЗапретаИзменения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Раздел.Установить(Раздел);
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	
	Если ЗначениеЗаполнено(ДатаЗапретаДоОткрытия) Тогда
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.Раздел = Раздел;
			Запись.Объект = Объект;
			Запись.Пользователь = Пользователь;
		Иначе
			Запись = НаборЗаписей[0];
		КонецЕсли;
		Запись.ДатаЗапрета = ДатаЗапретаДоОткрытия;
		Запись.ОписаниеДатыЗапрета = "";
		Если БылаАвто Тогда
			Запись.Комментарий = ПрефиксАвтоКомментария();
		ИначеЕсли ЭтоКомментарийОткрытия(Запись.Комментарий) Тогда
			Запись.Комментарий = "";
		КонецЕсли;
		НаборЗаписей.Записать();
	Иначе
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ПрочитатьТиповуюЗапись(Раздел, Объект, Пользователь)
	
	Результат = Новый Структура("ДатаЗапрета, Комментарий, ЕстьЗапись", '00010101', "", Ложь);
	
	НаборЗаписей = РегистрыСведений.ДатыЗапретаИзменения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Раздел.Установить(Раздел);
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		Результат.ЕстьЗапись = Истина;
		Результат.ДатаЗапрета = НаборЗаписей[0].ДатаЗапрета;
		Результат.Комментарий = НаборЗаписей[0].Комментарий;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПрочитатьСостояние(Раздел, Объект, Пользователь)
	
	МенеджерЗаписи = РегистрыСведений.нп_СостояниеОткрытыхПериодов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.РазделДатыЗапрета = Раздел;
	МенеджерЗаписи.ОбъектДатыЗапрета = Объект;
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Прочитать();
	
	Если Не МенеджерЗаписи.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ЗаявкаНаОткрытиеПериода", МенеджерЗаписи.ЗаявкаНаОткрытиеПериода);
	Результат.Вставить("ДатаОкончанияДействия", МенеджерЗаписи.ДатаОкончанияДействия);
	Результат.Вставить("ДатаЗапретаДоОткрытия", МенеджерЗаписи.ДатаЗапретаДоОткрытия);
	Результат.Вставить("ЗаписьБылаУстановленаАвтоматически", МенеджерЗаписи.ЗаписьБылаУстановленаАвтоматически);
	Возврат Результат;
	
КонецФункции

Функция ЕстьДействующееСостояниеКомбинации(Раздел, Объект, Пользователь)
	
	Возврат ПрочитатьСостояние(Раздел, Объект, Пользователь) <> Неопределено;
	
КонецФункции

Процедура ЗаписатьСостояние(Раздел, Объект, Пользователь, Заявка, ДатаОкончания, ДатаДоОткрытия, БылаАвто)
	
	МенеджерЗаписи = РегистрыСведений.нп_СостояниеОткрытыхПериодов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.РазделДатыЗапрета = Раздел;
	МенеджерЗаписи.ОбъектДатыЗапрета = Объект;
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.ЗаявкаНаОткрытиеПериода = Заявка;
	МенеджерЗаписи.ДатаОкончанияДействия = ДатаОкончания;
	МенеджерЗаписи.ДатаЗапретаДоОткрытия = ДатаДоОткрытия;
	МенеджерЗаписи.ЗаписьБылаУстановленаАвтоматически = БылаАвто;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура УдалитьСостояние(Раздел, Объект, Пользователь)
	
	МенеджерЗаписи = РегистрыСведений.нп_СостояниеОткрытыхПериодов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.РазделДатыЗапрета = Раздел;
	МенеджерЗаписи.ОбъектДатыЗапрета = Объект;
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Функция НачатьЗаписьТиповогоРегистра()
	
	ПроверкаБылаОтключена = ДатыЗапретаИзменения.ПроверкаДатЗапретаОтключена();
	ДатыЗапретаИзменения.ОтключитьПроверкуДатЗапрета(Истина);
	Возврат ПроверкаБылаОтключена;
	
КонецФункции

Процедура ЗакончитьЗаписьТиповогоРегистра(ПроверкаБылаОтключена)
	
	ДатыЗапретаИзменения.ОтключитьПроверкуДатЗапрета(ПроверкаБылаОтключена);
	
КонецПроцедуры

Процедура ОтправитьУведомлениеОбОшибках(Ошибки)
	
	ТекстОшибок = СтрСоединить(Ошибки, Символы.ПС + Символы.ПС);
	ЗаписатьВЖурнал(
		УровеньЖурналаРегистрации.Ошибка,
		НСтр("ru = 'Задание сдвига дат запрета завершилось с ошибками'"),
		Неопределено,
		ТекстОшибок);
	
	Адреса = СокрЛП(Строка(Константы.нп_ПолучателиУведомленийСдвигаДатЗапрета.Получить()));
	Если ПустаяСтрока(Адреса) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна() Тогда
		ЗаписатьВЖурнал(
			УровеньЖурналаРегистрации.Предупреждение,
			НСтр("ru = 'Системная учётная запись почты недоступна, уведомление не отправлено'"));
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрыПисьма = Новый Структура;
		ПараметрыПисьма.Вставить("Кому", Адреса);
		ПараметрыПисьма.Вставить("Тема", НСтр("ru = 'Ошибки сдвига дат запрета изменения'"));
		ПараметрыПисьма.Вставить("Тело", ТекстОшибок);
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(
			РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),
			ПараметрыПисьма);
	Исключение
		ЗаписатьВЖурнал(
			УровеньЖурналаРегистрации.Предупреждение,
			НСтр("ru = 'Не удалось отправить уведомление об ошибках сдвига дат запрета'"),
			Неопределено,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Функция КраткоеИПодробноеОписаниеОшибки(Контекст, Информация)
	
	ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Ошибка, Контекст, Неопределено, ПодробноеПредставлениеОшибки(Информация));
	Возврат Контекст + Символы.ПС + КраткоеПредставлениеОшибки(Информация);
	
КонецФункции

Процедура ЗаписатьВЖурнал(Уровень, Сообщение, Данные = Неопределено, Комментарий = "")
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытияЖурнала(),
		Уровень,
		,
		Данные,
		?(ПустаяСтрока(Комментарий), Сообщение, Сообщение + Символы.ПС + Комментарий));
	
КонецПроцедуры

Функция ИмяСобытияЖурнала()
	
	Возврат "нп_СдвигДатЗапретаИзменения";
	
КонецФункции

#КонецОбласти
